{
  'alex':{
    'login': 'alex',
    'password': '12345'
  },
  'article': {
    'head': 'Описание приложения',
    'text':

      "<p>Привет. Это статья, где я объясню чуть-чуть, как работает это приложение.</p> \
      <p>Все данные для статьи/авторизации/регистрации/комментариев хранятся в файлике <em>data.json</em>, который лежит в папке <em>src</em>. Там есть уже созданная одна учетная запись, статья и несколько комментариев.</p> \
      <p>ВАЖНО! При регистрации нового пользователя или добавлении комментария, он не добавляется в этот файл, т.к. я не могу редактировать локальные файлы((( При добавлении нового пользователя, данные будут храниться в хранилище <em>vuex</em> и сотрутся при перезапуске приложения (но во время этого запуска, можно создать неограниченное количество учетных записей и комментариев).</p> \
      <p>Сразу оговорюсь, что в погоне за простотой я использовал Parcel вместо Webpack и кажется из-за этого у меня не получилось разделять компоненты на три файла: .vue, .css, .js. Т.к. файлы подгружались неправильно, а стили разных компонентов перезаписывали друг друга. Поэтому скрипты писались в файле .vue, а для стилей использовался один файл (приложение маленькое, поэтому не критично - да и стилей я особо много и не написал).</p> \
      <p><strong>Регистрация</strong></p> \
      <p>Проверки данных нет (не было указано по заданию), поэтому при регистрации можно ввести любую абракадабру, которая может сломать код. Убедительная просьба так не делать. Так же из-за особенностей файла json нельзя создавать пользователей с именами: article и comments, т.к. эти имена зарезервированы для хранения текста статьи и комментариев. Если вы попробуете, создать пользователя с таким именем - ничего не произойдет, т.к. прежде чем записать нового юзера, происходит проверка, нет ли такого имени в данный момент. </p> \
      <p><strong>Авторизация</strong></p> \
      <p>Тоже самое. После нажатия на кнопку авторизации, в форме заполняете данные и осуществляется в ход в приложение.</p> \
      <p>Тестовая учетная запись:</p> \
      <ul> \
       	<li>Логин: alex</li> \
       	<li>Пароль: 12345</li> \
      </ul> \
      <p>(Регистр букв имеет значение).</p> \
      <p><strong>Комментарии</strong></p> \
      <p>Кнопка 'добавить комментарий' (или 'Комментировать') не видна, если  пользователь не авторизовался. После авторизации, появляется возможность комментирования.</p>"
  },
  'comments': [
    {
      "login": "Доброжелатель",
      "text": "Будьте аккуратны, если решите брать на работу этого разработчика. Он любитель не очень умные шутки шутить!",
      "date": "2020-09-20T15:02:46.621Z"
    },
    {
      "login": "alex",
      "text": "Воу. Шикарная статья. Но дизайн слабоват....",
      "date": "2020-09-20T15:04:04.959Z"
    },
    {
      "login": "Котопес",
      "text": "Да ничего не слабоват. Котики рулят!!!!! \nИли собаки?\nИли котики?",
      "date": "2020-09-20T15:04:52.721Z"
    },
    {
      "login": "IvanIvanov",
      "text": "Да ладно вам. Неплохо получилось))) Ставлю лайк.\n\nЭээээээммм. А где тут лайк поставить?",
      "date": "2020-09-20T15:06:42.104Z"
    },
    {
      "login": "SuperMaster",
      "text": "Иди учи CSS, щегол!",
      "date": "2020-09-20T15:09:24.452Z"
    }
  ]
}
